[Killed] BlockStatement
src/shared/api/settings-codec.ts:3:76
 import { type AppSettingsOutput, appSettingsSchema } from "@/shared/config/settings-schema";
 
-export function decodeSettingsPayload(payload: unknown): AppSettingsOutput {
-	const parsed = appSettingsSchema.safeParse(payload);
-	if (parsed.success) {
-		return parsed.data;
-	}
-	// Fall back to schema defaults. `parse({})` throws if the schema can't
-	// produce defaults — that's a programming error in the schema, not a
-	// runtime concern, so propagating the throw is correct.
-	return appSettingsSchema.parse({});
-}
+export function decodeSettingsPayload(payload: unknown): AppSettingsOutput {}
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\api\settings-codec.test.ts:

3 | import { decodeSettingsPayload } from "./settings-codec";
4 | 
5 | describe("decodeSettingsPayload", () => {

[Killed] BlockStatement
src/shared/api/settings-codec.ts:5:22
 
 export function decodeSettingsPayload(payload: unknown): AppSettingsOutput {
 	const parsed = appSettingsSchema.safeParse(payload);
-	if (parsed.success) {
-		return parsed.data;
-	}
+	if (parsed.success) {}
 	// Fall back to schema defaults. `parse({})` throws if the schema can't
 	// produce defaults — that's a programming error in the schema, not a
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\api\settings-codec.test.ts:

13 | 		const settings = decodeSettingsPayload({
14 | 			general: {
15 | 				recordingMode: "toggle",

[Killed] ConditionalExpression
src/shared/api/settings-codec.ts:5:6
 
 export function decodeSettingsPayload(payload: unknown): AppSettingsOutput {
 	const parsed = appSettingsSchema.safeParse(payload);
-	if (parsed.success) {
+	if (false) {
 		return parsed.data;
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\api\settings-codec.test.ts:

13 | 		const settings = decodeSettingsPayload({
14 | 			general: {
15 | 				recordingMode: "toggle",
