[Killed] BlockStatement
src/shared/lib/errors.ts:9:66
 	readonly context?: Record<string, unknown>;
 	readonly timestamp: number;
 
-	constructor(message: string, context?: Record<string, unknown>) {
-		super(message);
-		this.name = this.constructor.name;
-		this.context = context;
-		this.timestamp = Date.now();
-
-		// Maintains proper stack trace for where error was thrown.
-		// V8 (Electron main + renderer) and JSC (Bun) both define this.
-		Error.captureStackTrace(this, this.constructor);
-	}
+	constructor(message: string, context?: Record<string, unknown>) {}
 
 	toJSON(): Record<string, unknown> {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

62 |       this.context = context;
63 |       this.timestamp = Date.now();
64 |

[Killed] BlockStatement
src/shared/lib/errors.ts:20:36
 		Error.captureStackTrace(this, this.constructor);
 	}
 
-	toJSON(): Record<string, unknown> {
-		return {
-			name: this.name,
-			message: this.message,
-			context: this.context,
-			timestamp: this.timestamp,
-			stack: this.stack,
-		};
-	}
+	toJSON(): Record<string, unknown> {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

36 | 	});
37 | 
38 | 	test("toJSON includes name, message, context, timestamp, stack", () => {

[Killed] BlockStatement
src/shared/lib/errors.ts:37:82
 export class ValidationError extends ApplicationError {
 	readonly field?: string;
 
-	constructor(message: string, field?: string, context?: Record<string, unknown>) {
-		super(message, context);
-		this.field = field;
-	}
+	constructor(message: string, field?: string, context?: Record<string, unknown>) {}
 
 	override toJSON(): Record<string, unknown> {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

92 |     if (stryMutAct_9fa48("7")) {
93 |       {}
94 |     } else {

[Killed] BlockStatement
src/shared/lib/errors.ts:42:45
 		this.field = field;
 	}
 
-	override toJSON(): Record<string, unknown> {
-		return {
-			...super.toJSON(),
-			field: this.field,
-		};
-	}
+	override toJSON(): Record<string, unknown> {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

55 | 	});
56 | 
57 | 	test("toJSON merges parent fields with field", () => {

[Killed] BlockStatement
src/shared/lib/errors.ts:57:97
 	readonly resource: string;
 	readonly identifier?: string | number;
 
-	constructor(resource: string, identifier?: string | number, context?: Record<string, unknown>) {
-		const msg = identifier
-			? `${resource} with identifier "${identifier}" not found`
-			: `${resource} not found`;
-		super(msg, context);
-		this.resource = resource;
-		this.identifier = identifier;
-	}
+	constructor(resource: string, identifier?: string | number, context?: Record<string, unknown>) {}
 
 	override toJSON(): Record<string, unknown> {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

122 |     } else {
123 |       stryCov_9fa48("10");
124 |       const msg = identifier ? stryMutAct_9fa48("11") ? `` : (stryCov_9fa48("11"), `${resource} with identifier "${identifier}" not found`) : stryMutAct_9fa48("12") ? `` : (stryCov_9fa48("12"), `${resource} not found`);

[Killed] BlockStatement
src/shared/lib/errors.ts:66:45
 		this.identifier = identifier;
 	}
 
-	override toJSON(): Record<string, unknown> {
-		return {
-			...super.toJSON(),
-			resource: this.resource,
-			identifier: this.identifier,
-		};
-	}
+	override toJSON(): Record<string, unknown> {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

83 | 	});
84 | 
85 | 	test("toJSON includes resource and identifier", () => {

[Killed] BooleanLiteral
src/shared/lib/errors.ts:85:15
 	constructor(
 		message: string,
 		endpoint?: string,
-		retryable = true,
+		retryable = false,
 		context?: Record<string, unknown>
 	) {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

91 | });
92 | 
93 | describe("ConnectionError", () => {

[Killed] BlockStatement
src/shared/lib/errors.ts:87:4
 		endpoint?: string,
 		retryable = true,
 		context?: Record<string, unknown>
-	) {
-		super(message, context);
-		this.endpoint = endpoint;
-		this.retryable = retryable;
-	}
+	) {}
 
 	override toJSON(): Record<string, unknown> {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

152 |       {}
153 |     } else {
154 |       stryCov_9fa48("16");

[Killed] BlockStatement
src/shared/lib/errors.ts:93:45
 		this.retryable = retryable;
 	}
 
-	override toJSON(): Record<string, unknown> {
-		return {
-			...super.toJSON(),
-			endpoint: this.endpoint,
-			retryable: this.retryable,
-		};
-	}
+	override toJSON(): Record<string, unknown> {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

103 | 	});
104 | 
105 | 	test("toJSON includes endpoint and retryable", () => {

[Killed] BlockStatement
src/shared/lib/errors.ts:109:88
 	readonly timeoutMs: number;
 	readonly operation?: string;
 
-	constructor(timeoutMs: number, operation?: string, context?: Record<string, unknown>) {
-		const msg = operation
-			? `Operation "${operation}" timed out after ${timeoutMs}ms`
-			: `Operation timed out after ${timeoutMs}ms`;
-		super(msg, context);
-		this.timeoutMs = timeoutMs;
-		this.operation = operation;
-	}
+	constructor(timeoutMs: number, operation?: string, context?: Record<string, unknown>) {}
 
 	override toJSON(): Record<string, unknown> {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

183 |     } else {
184 |       stryCov_9fa48("19");
185 |       const msg = operation ? stryMutAct_9fa48("20") ? `` : (stryCov_9fa48("20"), `Operation "${operation}" timed out after ${timeoutMs}ms`) : stryMutAct_9fa48("21") ? `` : (stryCov_9fa48("21"), `Operation timed out after ${timeoutMs}ms`);

[Killed] BlockStatement
src/shared/lib/errors.ts:118:45
 		this.operation = operation;
 	}
 
-	override toJSON(): Record<string, unknown> {
-		return {
-			...super.toJSON(),
-			timeoutMs: this.timeoutMs,
-			operation: this.operation,
-		};
-	}
+	override toJSON(): Record<string, unknown> {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

123 | 		expect(err.message).toBe("Operation timed out after 2000ms");
124 | 	});
125 |

[Killed] BlockStatement
src/shared/lib/errors.ts:139:4
 		channel: string,
 		operation: "invoke" | "send" | "on",
 		context?: Record<string, unknown>
-	) {
-		super(message, context);
-		this.channel = channel;
-		this.ipcOperation = operation;
-	}
+	) {}
 
 	override toJSON(): Record<string, unknown> {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

213 |       {}
214 |     } else {
215 |       stryCov_9fa48("24");

[Killed] BlockStatement
src/shared/lib/errors.ts:145:45
 		this.ipcOperation = operation;
 	}
 
-	override toJSON(): Record<string, unknown> {
-		return {
-			...super.toJSON(),
-			channel: this.channel,
-			ipcOperation: this.ipcOperation,
-		};
-	}
+	override toJSON(): Record<string, unknown> {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

137 | 		expect(err.ipcOperation).toBe("invoke");
138 | 	});
139 |

[Killed] BlockStatement
src/shared/lib/errors.ts:166:4
 		filePath: string,
 		operation: "read" | "write" | "delete" | "exists" | "stat",
 		context?: Record<string, unknown>
-	) {
-		super(message, context);
-		this.filePath = filePath;
-		this.operation = operation;
-	}
+	) {}
 
 	override toJSON(): Record<string, unknown> {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

243 |       {}
244 |     } else {
245 |       stryCov_9fa48("27");

[Killed] BlockStatement
src/shared/lib/errors.ts:172:45
 		this.operation = operation;
 	}
 
-	override toJSON(): Record<string, unknown> {
-		return {
-			...super.toJSON(),
-			filePath: this.filePath,
-			operation: this.operation,
-		};
-	}
+	override toJSON(): Record<string, unknown> {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

151 | 		expect(err.operation).toBe("read");
152 | 	});
153 |

[Killed] ObjectLiteral
src/shared/lib/errors.ts:173:10
 	}
 
 	override toJSON(): Record<string, unknown> {
-		return {
-			...super.toJSON(),
-			filePath: this.filePath,
-			operation: this.operation,
-		};
+		return {};
 	}
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

151 | 		expect(err.operation).toBe("read");
152 | 	});
153 |

[Killed] BlockStatement
src/shared/lib/errors.ts:193:4
 		command: string,
 		exitCode?: number,
 		context?: Record<string, unknown>
-	) {
-		super(message, context);
-		this.command = command;
-		this.exitCode = exitCode;
-	}
+	) {}
 
 	override toJSON(): Record<string, unknown> {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

273 |       {}
274 |     } else {
275 |       stryCov_9fa48("30");

[Killed] BlockStatement
src/shared/lib/errors.ts:199:45
 		this.exitCode = exitCode;
 	}
 
-	override toJSON(): Record<string, unknown> {
-		return {
-			...super.toJSON(),
-			command: this.command,
-			exitCode: this.exitCode,
-		};
-	}
+	override toJSON(): Record<string, unknown> {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

170 | 		expect(err.exitCode).toBeUndefined();
171 | 	});
172 |

[Killed] BlockStatement
src/shared/lib/errors.ts:211:79
 /**
  * Type guard to check if an error is an ApplicationError.
  */
-export function isApplicationError(error: unknown): error is ApplicationError {
-	return error instanceof ApplicationError;
-}
+export function isApplicationError(error: unknown): error is ApplicationError {}
 
 // Error instances pass through this duck-typing predicate unchanged:
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

177 | 	});
178 | });
179 |

[Killed] BlockStatement
src/shared/lib/errors.ts:218:73
 // Error instances pass through this duck-typing predicate unchanged:
 // `Error.prototype.message === ""` so even a default `new Error()`
 // satisfies `"message" in error`.
-function isMessageBearer(error: unknown): error is { message: unknown } {
-	return Boolean(error && typeof error === "object" && "message" in error);
-}
+function isMessageBearer(error: unknown): error is { message: unknown } {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

193 | 	});
194 | });
195 |

[Killed] LogicalOperator
src/shared/lib/errors.ts:219:17
 // `Error.prototype.message === ""` so even a default `new Error()`
 // satisfies `"message" in error`.
 function isMessageBearer(error: unknown): error is { message: unknown } {
-	return Boolean(error && typeof error === "object" && "message" in error);
+	return Boolean(error || typeof error === "object" && "message" in error);
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

312 | } {
313 |   if (stryMutAct_9fa48("34")) {
314 |     {}

[Killed] ConditionalExpression
src/shared/lib/errors.ts:219:17
 // `Error.prototype.message === ""` so even a default `new Error()`
 // satisfies `"message" in error`.
 function isMessageBearer(error: unknown): error is { message: unknown } {
-	return Boolean(error && typeof error === "object" && "message" in error);
+	return Boolean(true);
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

325 |   if (stryMutAct_9fa48("44")) {
326 |     {}
327 |   } else {

[Killed] BlockStatement
src/shared/lib/errors.ts:225:57
 /**
  * Extract a safe error message from unknown error type.
  */
-export function getErrorMessage(error: unknown): string {
-	if (typeof error === "string") return error;
-	if (isMessageBearer(error)) return String(error.message);
-	return "Unknown error occurred";
-}
+export function getErrorMessage(error: unknown): string {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

193 | 	});
194 | });
195 |

[Killed] ConditionalExpression
src/shared/lib/errors.ts:226:6
  * Extract a safe error message from unknown error type.
  */
 export function getErrorMessage(error: unknown): string {
-	if (typeof error === "string") return error;
+	if (false) return error;
 	if (isMessageBearer(error)) return String(error.message);
 	return "Unknown error occurred";
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

209 | 		}
210 | 		expect(getErrorMessage(new MyError())).toBe("from-error-class");
211 | 	});

[Killed] ConditionalExpression
src/shared/lib/errors.ts:226:6
  * Extract a safe error message from unknown error type.
  */
 export function getErrorMessage(error: unknown): string {
-	if (typeof error === "string") return error;
+	if (true) return error;
 	if (isMessageBearer(error)) return String(error.message);
 	return "Unknown error occurred";
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

193 | 	});
194 | });
195 |

[Killed] ConditionalExpression
src/shared/lib/errors.ts:227:6
  */
 export function getErrorMessage(error: unknown): string {
 	if (typeof error === "string") return error;
-	if (isMessageBearer(error)) return String(error.message);
+	if (false) return String(error.message);
 	return "Unknown error occurred";
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

193 | 	});
194 | });
195 |

[Killed] ConditionalExpression
src/shared/lib/errors.ts:227:6
  */
 export function getErrorMessage(error: unknown): string {
 	if (typeof error === "string") return error;
-	if (isMessageBearer(error)) return String(error.message);
+	if (true) return String(error.message);
 	return "Unknown error occurred";
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

325 |   if (stryMutAct_9fa48("44")) {
326 |     {}
327 |   } else {

[Killed] StringLiteral
src/shared/lib/errors.ts:228:9
 export function getErrorMessage(error: unknown): string {
 	if (typeof error === "string") return error;
 	if (isMessageBearer(error)) return String(error.message);
-	return "Unknown error occurred";
+	return "";
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

218 | 		expect(getErrorMessage({ message: "obj" })).toBe("obj");
219 | 		expect(getErrorMessage({ message: 42 })).toBe("42");
220 | 	});

[Killed] BlockStatement
src/shared/lib/errors.ts:234:67
 /**
  * Extract error stack trace safely.
  */
-export function getErrorStack(error: unknown): string | undefined {
-	if (error instanceof Error) {
-		return error.stack;
-	}
-	return;
-}
+export function getErrorStack(error: unknown): string | undefined {}
 
 function formatErrorContext(error: unknown): string {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

233 | });
234 | 
235 | describe("getErrorStack", () => {

[Killed] ConditionalExpression
src/shared/lib/errors.ts:235:6
  * Extract error stack trace safely.
  */
 export function getErrorStack(error: unknown): string | undefined {
-	if (error instanceof Error) {
+	if (true) {
 		return error.stack;
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

343 |     if (stryMutAct_9fa48("54") ? false : stryMutAct_9fa48("53") ? true : (stryCov_9fa48("53", "54"), error instanceof Error)) {
344 |       if (stryMutAct_9fa48("55")) {
345 |         {}

[Killed] ConditionalExpression
src/shared/lib/errors.ts:235:6
  * Extract error stack trace safely.
  */
 export function getErrorStack(error: unknown): string | undefined {
-	if (error instanceof Error) {
+	if (false) {
 		return error.stack;
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

233 | });
234 | 
235 | describe("getErrorStack", () => {

[Killed] BlockStatement
src/shared/lib/errors.ts:241:53
 	return;
 }
 
-function formatErrorContext(error: unknown): string {
-	return isApplicationError(error) && error.context
-		? `\nContext: ${JSON.stringify(error.context, null, 2)}`
-		: "";
-}
+function formatErrorContext(error: unknown): string {}
 
 function formatErrorPrefix(prefix: string, message: string): string {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

254 | 
255 | 	test("appends the stack trace separated by a newline (locks in the `\\n${stack}` template)", () => {
256 | 		const err = new Error("boom");

[Killed] ConditionalExpression
src/shared/lib/errors.ts:242:9
 }
 
 function formatErrorContext(error: unknown): string {
-	return isApplicationError(error) && error.context
+	return true
 		? `\nContext: ${JSON.stringify(error.context, null, 2)}`
 		: "";
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

254 | 
255 | 	test("appends the stack trace separated by a newline (locks in the `\\n${stack}` template)", () => {
256 | 		const err = new Error("boom");

[Killed] ConditionalExpression
src/shared/lib/errors.ts:242:9
 }
 
 function formatErrorContext(error: unknown): string {
-	return isApplicationError(error) && error.context
+	return false
 		? `\nContext: ${JSON.stringify(error.context, null, 2)}`
 		: "";
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

269 | 	});
270 | 
271 | 	test("includes context for ApplicationError", () => {

[Killed] BlockStatement
src/shared/lib/errors.ts:247:69
 		: "";
 }
 
-function formatErrorPrefix(prefix: string, message: string): string {
-	return prefix ? `${prefix}: ${message}` : message;
-}
+function formatErrorPrefix(prefix: string, message: string): string {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

254 | 
255 | 	test("appends the stack trace separated by a newline (locks in the `\\n${stack}` template)", () => {
256 | 		const err = new Error("boom");

[Killed] BlockStatement
src/shared/lib/errors.ts:254:72
 /**
  * Format error for logging with full context.
  */
-export function formatErrorForLog(error: unknown, prefix = ""): string {
-	const head = formatErrorPrefix(prefix, getErrorMessage(error));
-	const stack = getErrorStack(error);
-	return `${head}${formatErrorContext(error)}${stack ? `\n${stack}` : ""}`;
-}
+export function formatErrorForLog(error: unknown, prefix = ""): string {}
 
 interface RetryConfig {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

247 | 
248 | describe("formatErrorForLog", () => {
249 | 	test("formats plain Error with stack", () => {

[Killed] StringLiteral
src/shared/lib/errors.ts:257:9
 export function formatErrorForLog(error: unknown, prefix = ""): string {
 	const head = formatErrorPrefix(prefix, getErrorMessage(error));
 	const stack = getErrorStack(error);
-	return `${head}${formatErrorContext(error)}${stack ? `\n${stack}` : ""}`;
+	return ``;
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

247 | 
248 | describe("formatErrorForLog", () => {
249 | 	test("formats plain Error with stack", () => {

[Killed] BlockStatement
src/shared/lib/errors.ts:272:12
 	attempt: number,
 	error: unknown,
 	cfg: RetryConfig
-): boolean {
-	return attempt < cfg.maxAttempts && cfg.shouldRetry(error, attempt);
-}
+): boolean {}
 
 async function waitBeforeRetry(
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

296 | 					calls += 1;
297 | 					throw new Error(`fail-${calls}`);
298 | 				},

[Killed] ConditionalExpression
src/shared/lib/errors.ts:273:9
 	error: unknown,
 	cfg: RetryConfig
 ): boolean {
-	return attempt < cfg.maxAttempts && cfg.shouldRetry(error, attempt);
+	return false;
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:
296 | 					calls += 1;
297 | 					throw new Error(`fail-${calls}`);
298 | 				},
299 | 				{ maxAttempts: 3, delayMs: 1, backoffMultiplier: 1 }

[Killed] EqualityOperator
src/shared/lib/errors.ts:273:9
 	error: unknown,
 	cfg: RetryConfig
 ): boolean {
-	return attempt < cfg.maxAttempts && cfg.shouldRetry(error, attempt);
+	return attempt <= cfg.maxAttempts && cfg.shouldRetry(error, attempt);
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

296 | 					calls += 1;
297 | 					throw new Error(`fail-${calls}`);
298 | 				},

[Killed] BlockStatement
src/shared/lib/errors.ts:280:18
 	error: unknown,
 	attempt: number,
 	cfg: RetryConfig
-): Promise<void> {
-	cfg.onRetry?.(error, attempt);
-	const delay = cfg.delayMs * cfg.backoffMultiplier ** (attempt - 1);
-	await new Promise((resolve) => setTimeout(resolve, delay));
-}
+): Promise<void> {}
 
 async function tryAttempt<T>(
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

316 | 		expect(timestamps).toHaveLength(3);
317 | 		// Gap 1 → ~50ms (50 * 3^0), gap 2 → ~150ms (50 * 3^1).
318 | 		// timer skew on Windows can be 16ms, so assert a generous band.

[Killed] OptionalChaining
src/shared/lib/errors.ts:281:2
 	attempt: number,
 	cfg: RetryConfig
 ): Promise<void> {
-	cfg.onRetry?.(error, attempt);
+	cfg.onRetry(error, attempt);
 	const delay = cfg.delayMs * cfg.backoffMultiplier ** (attempt - 1);
 	await new Promise((resolve) => setTimeout(resolve, delay));
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

296 | 					calls += 1;
297 | 					throw new Error(`fail-${calls}`);
298 | 				},

[Killed] ArithmeticOperator
src/shared/lib/errors.ts:282:16
 	cfg: RetryConfig
 ): Promise<void> {
 	cfg.onRetry?.(error, attempt);
-	const delay = cfg.delayMs * cfg.backoffMultiplier ** (attempt - 1);
+	const delay = cfg.delayMs / cfg.backoffMultiplier ** (attempt - 1);
 	await new Promise((resolve) => setTimeout(resolve, delay));
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

319 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
320 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);
321 | 		expect(gap1).toBeGreaterThanOrEqual(40);

[Killed] ArithmeticOperator
src/shared/lib/errors.ts:282:56
 	cfg: RetryConfig
 ): Promise<void> {
 	cfg.onRetry?.(error, attempt);
-	const delay = cfg.delayMs * cfg.backoffMultiplier ** (attempt - 1);
+	const delay = cfg.delayMs * cfg.backoffMultiplier ** (attempt + 1);
 	await new Promise((resolve) => setTimeout(resolve, delay));
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

317 | 		// Gap 1 → ~50ms (50 * 3^0), gap 2 → ~150ms (50 * 3^1).
318 | 		// timer skew on Windows can be 16ms, so assert a generous band.
319 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);

[Timeout] ArrowFunction
src/shared/lib/errors.ts:283:20
 ): Promise<void> {
 	cfg.onRetry?.(error, attempt);
 	const delay = cfg.delayMs * cfg.backoffMultiplier ** (attempt - 1);
-	await new Promise((resolve) => setTimeout(resolve, delay));
+	await new Promise(() => undefined);
 }
 

[Killed] BlockStatement
src/shared/lib/errors.ts:290:15
 	fn: () => Promise<T>,
 	attempt: number,
 	cfg: RetryConfig
-): Promise<T> {
-	try {
-		return await fn();
-	} catch (error) {
-		if (!shouldKeepRetrying(attempt, error, cfg)) throw error;
-		await waitBeforeRetry(error, attempt, cfg);
-		return tryAttempt(fn, attempt + 1, cfg);
-	}
-}
+): Promise<T> {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

283 | });
284 | 
285 | describe("retryAsync", () => {

[Killed] BlockStatement
src/shared/lib/errors.ts:293:18
 ): Promise<T> {
 	try {
 		return await fn();
-	} catch (error) {
-		if (!shouldKeepRetrying(attempt, error, cfg)) throw error;
-		await waitBeforeRetry(error, attempt, cfg);
-		return tryAttempt(fn, attempt + 1, cfg);
-	}
+	} catch (error) {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

296 | 					calls += 1;
297 | 					throw new Error(`fail-${calls}`);
298 | 				},

[Killed] ConditionalExpression
src/shared/lib/errors.ts:294:7
 	try {
 		return await fn();
 	} catch (error) {
-		if (!shouldKeepRetrying(attempt, error, cfg)) throw error;
+		if (true) throw error;
 		await waitBeforeRetry(error, attempt, cfg);
 		return tryAttempt(fn, attempt + 1, cfg);
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

296 | 					calls += 1;
297 | 					throw new Error(`fail-${calls}`);
298 | 				},

[Timeout] BooleanLiteral
src/shared/lib/errors.ts:294:7
 	try {
 		return await fn();
 	} catch (error) {
-		if (!shouldKeepRetrying(attempt, error, cfg)) throw error;
+		if (shouldKeepRetrying(attempt, error, cfg)) throw error;
 		await waitBeforeRetry(error, attempt, cfg);
 		return tryAttempt(fn, attempt + 1, cfg);

[Timeout] ArithmeticOperator
src/shared/lib/errors.ts:296:25
 	} catch (error) {
 		if (!shouldKeepRetrying(attempt, error, cfg)) throw error;
 		await waitBeforeRetry(error, attempt, cfg);
-		return tryAttempt(fn, attempt + 1, cfg);
+		return tryAttempt(fn, attempt - 1, cfg);
 	}
 }

[Killed] BlockStatement
src/shared/lib/errors.ts:312:15
 		shouldRetry?: (error: unknown, attempt: number) => boolean;
 		onRetry?: (error: unknown, attempt: number) => void;
 	} = {}
-): Promise<T> {
-	return tryAttempt(fn, 1, {
-		maxAttempts: options.maxAttempts ?? 3,
-		delayMs: options.delayMs ?? 1000,
-		backoffMultiplier: options.backoffMultiplier ?? 2,
-		shouldRetry: options.shouldRetry ?? (() => true),
-		onRetry: options.onRetry,
-	});
-}
+): Promise<T> {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

283 | });
284 | 
285 | describe("retryAsync", () => {

[Killed] LogicalOperator
src/shared/lib/errors.ts:314:16
 	} = {}
 ): Promise<T> {
 	return tryAttempt(fn, 1, {
-		maxAttempts: options.maxAttempts ?? 3,
+		maxAttempts: options.maxAttempts && 3,
 		delayMs: options.delayMs ?? 1000,
 		backoffMultiplier: options.backoffMultiplier ?? 2,
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

383 | 			retryAsync(async () => {
384 | 				calls += 1;
385 | 				throw new Error("default-failure");

[Killed] LogicalOperator
src/shared/lib/errors.ts:315:12
 ): Promise<T> {
 	return tryAttempt(fn, 1, {
 		maxAttempts: options.maxAttempts ?? 3,
-		delayMs: options.delayMs ?? 1000,
+		delayMs: options.delayMs && 1000,
 		backoffMultiplier: options.backoffMultiplier ?? 2,
 		shouldRetry: options.shouldRetry ?? (() => true),
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

317 | 		// Gap 1 → ~50ms (50 * 3^0), gap 2 → ~150ms (50 * 3^1).
318 | 		// timer skew on Windows can be 16ms, so assert a generous band.
319 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);

[Killed] LogicalOperator
src/shared/lib/errors.ts:316:22
 	return tryAttempt(fn, 1, {
 		maxAttempts: options.maxAttempts ?? 3,
 		delayMs: options.delayMs ?? 1000,
-		backoffMultiplier: options.backoffMultiplier ?? 2,
+		backoffMultiplier: options.backoffMultiplier && 2,
 		shouldRetry: options.shouldRetry ?? (() => true),
 		onRetry: options.onRetry,
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] LogicalOperator
src/shared/lib/errors.ts:317:16
 		maxAttempts: options.maxAttempts ?? 3,
 		delayMs: options.delayMs ?? 1000,
 		backoffMultiplier: options.backoffMultiplier ?? 2,
-		shouldRetry: options.shouldRetry ?? (() => true),
+		shouldRetry: options.shouldRetry && (() => true),
 		onRetry: options.onRetry,
 	});
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

296 | 					calls += 1;
297 | 					throw new Error(`fail-${calls}`);
298 | 				},

[Killed] ArrowFunction
src/shared/lib/errors.ts:317:40
 		maxAttempts: options.maxAttempts ?? 3,
 		delayMs: options.delayMs ?? 1000,
 		backoffMultiplier: options.backoffMultiplier ?? 2,
-		shouldRetry: options.shouldRetry ?? (() => true),
+		shouldRetry: options.shouldRetry ?? (() => undefined),
 		onRetry: options.onRetry,
 	});
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

296 | 					calls += 1;
297 | 					throw new Error(`fail-${calls}`);
298 | 				},

[Killed] BlockStatement
src/shared/lib/errors.ts:328:53
 export function wrapAsync<TArgs extends unknown[], TReturn>(
 	fn: (...args: TArgs) => Promise<TReturn>,
 	errorHandler?: (error: unknown, args: TArgs) => void
-): (...args: TArgs) => Promise<TReturn | undefined> {
-	return async (...args: TArgs): Promise<TReturn | undefined> => {
-		try {
-			return await fn(...args);
-		} catch (error) {
-			errorHandler?.(error, args);
-			console.error(formatErrorForLog(error, `Error in ${fn.name || "async function"}`));
-			return;
-		}
-	};
-}
+): (...args: TArgs) => Promise<TReturn | undefined> {}
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

414 | });
415 | 
416 | describe("wrapAsync", () => {
