[Killed] BlockStatement
src/shared/lib/errors.ts:329:65
 	fn: (...args: TArgs) => Promise<TReturn>,
 	errorHandler?: (error: unknown, args: TArgs) => void
 ): (...args: TArgs) => Promise<TReturn | undefined> {
-	return async (...args: TArgs): Promise<TReturn | undefined> => {
-		try {
-			return await fn(...args);
-		} catch (error) {
-			errorHandler?.(error, args);
-			console.error(formatErrorForLog(error, `Error in ${fn.name || "async function"}`));
-			return;
-		}
-	};
+	return async (...args: TArgs): Promise<TReturn | undefined> => {};
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] BlockStatement
src/shared/lib/errors.ts:330:7
 	errorHandler?: (error: unknown, args: TArgs) => void
 ): (...args: TArgs) => Promise<TReturn | undefined> {
 	return async (...args: TArgs): Promise<TReturn | undefined> => {
-		try {
-			return await fn(...args);
-		} catch (error) {
+		try {} catch (error) {
 			errorHandler?.(error, args);
 			console.error(formatErrorForLog(error, `Error in ${fn.name || "async function"}`));
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] BlockStatement
src/shared/lib/errors.ts:332:19
 	return async (...args: TArgs): Promise<TReturn | undefined> => {
 		try {
 			return await fn(...args);
-		} catch (error) {
-			errorHandler?.(error, args);
-			console.error(formatErrorForLog(error, `Error in ${fn.name || "async function"}`));
-			return;
-		}
+		} catch (error) {}
 	};
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] OptionalChaining
src/shared/lib/errors.ts:333:4
 		try {
 			return await fn(...args);
 		} catch (error) {
-			errorHandler?.(error, args);
+			errorHandler(error, args);
 			console.error(formatErrorForLog(error, `Error in ${fn.name || "async function"}`));
 			return;
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

478 |         } catch (error) {
479 |           if (stryMutAct_9fa48("99")) {
480 |             {}

[Killed] ConditionalExpression
src/shared/lib/errors.ts:334:55
 			return await fn(...args);
 		} catch (error) {
 			errorHandler?.(error, args);
-			console.error(formatErrorForLog(error, `Error in ${fn.name || "async function"}`));
+			console.error(formatErrorForLog(error, `Error in ${true}`));
 			return;
 		}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

472 | 			}
473 | 			const wrapped = wrapAsync(namedInner);
474 | 			await wrapped();

[Killed] ConditionalExpression
src/shared/lib/errors.ts:334:55
 			return await fn(...args);
 		} catch (error) {
 			errorHandler?.(error, args);
-			console.error(formatErrorForLog(error, `Error in ${fn.name || "async function"}`));
+			console.error(formatErrorForLog(error, `Error in ${false}`));
 			return;
 		}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

472 | 			}
473 | 			const wrapped = wrapAsync(namedInner);
474 | 			await wrapped();
