[Killed] BlockStatement
src/shared/lib/ollama-endpoint.ts:4:54
 const TRAILING_API_PATH = /\/(?:api|v1)$/i;
 const TRAILING_SLASHES = /\/+$/;
 
-function stripTrailingSlashes(value: string): string {
-	return value.replace(TRAILING_SLASHES, "");
-}
+function stripTrailingSlashes(value: string): string {}
 
 function stripTrailingApiSegments(value: string): string {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

2 | import { describe, expect, test } from "bun:test";
3 | import { buildOllamaApiUrl, normalizeOllamaEndpoint } from "./ollama-endpoint";
4 |

[Killed] StringLiteral
src/shared/lib/ollama-endpoint.ts:5:41
 const TRAILING_SLASHES = /\/+$/;
 
 function stripTrailingSlashes(value: string): string {
-	return value.replace(TRAILING_SLASHES, "");
+	return value.replace(TRAILING_SLASHES, "Stryker was here!");
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

 7 | 		expect(normalizeOllamaEndpoint("")).toBe("");
 8 | 	});
 9 |

[Killed] BlockStatement
src/shared/lib/ollama-endpoint.ts:8:58
 	return value.replace(TRAILING_SLASHES, "");
 }
 
-function stripTrailingApiSegments(value: string): string {
-	let result = stripTrailingSlashes(value);
-	while (TRAILING_API_PATH.test(result)) {
-		result = stripTrailingSlashes(result.replace(TRAILING_API_PATH, ""));
-	}
-	return result;
-}
+function stripTrailingApiSegments(value: string): string {}
 
 export function normalizeOllamaEndpoint(endpoint: string): string {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

2 | import { describe, expect, test } from "bun:test";
3 | import { buildOllamaApiUrl, normalizeOllamaEndpoint } from "./ollama-endpoint";
4 |

[Killed] ConditionalExpression
src/shared/lib/ollama-endpoint.ts:10:9
 
 function stripTrailingApiSegments(value: string): string {
 	let result = stripTrailingSlashes(value);
-	while (TRAILING_API_PATH.test(result)) {
+	while (false) {
 		result = stripTrailingSlashes(result.replace(TRAILING_API_PATH, ""));
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

19 | 			"http://localhost:11434"
20 | 		);
21 | 	});

[Timeout] BlockStatement
src/shared/lib/ollama-endpoint.ts:10:41
 
 function stripTrailingApiSegments(value: string): string {
 	let result = stripTrailingSlashes(value);
-	while (TRAILING_API_PATH.test(result)) {
-		result = stripTrailingSlashes(result.replace(TRAILING_API_PATH, ""));
-	}
+	while (TRAILING_API_PATH.test(result)) {}
 	return result;
 }

[Killed] StringLiteral
src/shared/lib/ollama-endpoint.ts:11:67
 function stripTrailingApiSegments(value: string): string {
 	let result = stripTrailingSlashes(value);
 	while (TRAILING_API_PATH.test(result)) {
-		result = stripTrailingSlashes(result.replace(TRAILING_API_PATH, ""));
+		result = stripTrailingSlashes(result.replace(TRAILING_API_PATH, "Stryker was here!"));
 	}
 	return result;
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

19 | 			"http://localhost:11434"
20 | 		);
21 | 	});

[Killed] BlockStatement
src/shared/lib/ollama-endpoint.ts:16:67
 	return result;
 }
 
-export function normalizeOllamaEndpoint(endpoint: string): string {
-	const trimmed = endpoint.trim();
-	try {
-		const url = new URL(trimmed);
-		// URL spec: assigning an empty pathname to an http/https URL is
-		// auto-normalized back to "/", so an explicit `|| "/"` fallback is
-		// redundant.
-		url.pathname = stripTrailingApiSegments(url.pathname);
-		url.search = "";
-		url.hash = "";
-		return stripTrailingSlashes(url.toString());
-	} catch {
-		// Empty input and non-URL strings both flow here. The while loop
-		// is a no-op for empty input, so the early-return guard is also
-		// redundant.
-		return stripTrailingApiSegments(trimmed);
-	}
-}
+export function normalizeOllamaEndpoint(endpoint: string): string {}
 
 export function buildOllamaApiUrl(endpoint: string, apiPath: `/api/${string}`): string {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

2 | import { describe, expect, test } from "bun:test";
3 | import { buildOllamaApiUrl, normalizeOllamaEndpoint } from "./ollama-endpoint";
4 |

[Killed] MethodExpression
src/shared/lib/ollama-endpoint.ts:17:18
 }
 
 export function normalizeOllamaEndpoint(endpoint: string): string {
-	const trimmed = endpoint.trim();
+	const trimmed = endpoint;
 	try {
 		const url = new URL(trimmed);
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

 6 | 	test("returns empty string for empty input", () => {
 7 | 		expect(normalizeOllamaEndpoint("")).toBe("");
 8 | 	});

[Killed] BlockStatement
src/shared/lib/ollama-endpoint.ts:18:6
 
 export function normalizeOllamaEndpoint(endpoint: string): string {
 	const trimmed = endpoint.trim();
-	try {
-		const url = new URL(trimmed);
-		// URL spec: assigning an empty pathname to an http/https URL is
-		// auto-normalized back to "/", so an explicit `|| "/"` fallback is
-		// redundant.
-		url.pathname = stripTrailingApiSegments(url.pathname);
-		url.search = "";
-		url.hash = "";
-		return stripTrailingSlashes(url.toString());
-	} catch {
+	try {} catch {
 		// Empty input and non-URL strings both flow here. The while loop
 		// is a no-op for empty input, so the early-return guard is also
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] StringLiteral
src/shared/lib/ollama-endpoint.ts:24:16
 		// auto-normalized back to "/", so an explicit `|| "/"` fallback is
 		// redundant.
 		url.pathname = stripTrailingApiSegments(url.pathname);
-		url.search = "";
+		url.search = "Stryker was here!";
 		url.hash = "";
 		return stripTrailingSlashes(url.toString());
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

 7 | 		expect(normalizeOllamaEndpoint("")).toBe("");
 8 | 	});
 9 |

[Killed] StringLiteral
src/shared/lib/ollama-endpoint.ts:25:14
 		// redundant.
 		url.pathname = stripTrailingApiSegments(url.pathname);
 		url.search = "";
-		url.hash = "";
+		url.hash = "Stryker was here!";
 		return stripTrailingSlashes(url.toString());
 	} catch {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

 7 | 		expect(normalizeOllamaEndpoint("")).toBe("");
 8 | 	});
 9 |

[Killed] BlockStatement
src/shared/lib/ollama-endpoint.ts:27:10
 		url.search = "";
 		url.hash = "";
 		return stripTrailingSlashes(url.toString());
-	} catch {
-		// Empty input and non-URL strings both flow here. The while loop
-		// is a no-op for empty input, so the early-return guard is also
-		// redundant.
-		return stripTrailingApiSegments(trimmed);
-	}
+	} catch {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

2 | import { describe, expect, test } from "bun:test";
3 | import { buildOllamaApiUrl, normalizeOllamaEndpoint } from "./ollama-endpoint";
4 |

[Killed] BlockStatement
src/shared/lib/ollama-endpoint.ts:35:88
 	}
 }
 
-export function buildOllamaApiUrl(endpoint: string, apiPath: `/api/${string}`): string {
-	const normalized = normalizeOllamaEndpoint(endpoint);
-	const normalizedApiPath = apiPath.startsWith("/") ? apiPath : `/${apiPath}`;
-
-	try {
-		const url = new URL(normalized);
-		// stripTrailingSlashes("/") === "" so the explicit pathname==="/"
-		// branch is redundant — both produce the same basePath.
-		const basePath = stripTrailingSlashes(url.pathname);
-		url.pathname = `${basePath}${normalizedApiPath}`;
-		return url.toString();
-	} catch {
-		return `${stripTrailingSlashes(normalized)}${normalizedApiPath}`;
-	}
-}
+export function buildOllamaApiUrl(endpoint: string, apiPath: `/api/${string}`): string {}
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

 99 | 	});
100 | });
101 |

[Killed] MethodExpression
src/shared/lib/ollama-endpoint.ts:37:28
 
 export function buildOllamaApiUrl(endpoint: string, apiPath: `/api/${string}`): string {
 	const normalized = normalizeOllamaEndpoint(endpoint);
-	const normalizedApiPath = apiPath.startsWith("/") ? apiPath : `/${apiPath}`;
+	const normalizedApiPath = apiPath.endsWith("/") ? apiPath : `/${apiPath}`;
 
 	try {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

 99 | 	});
100 | });
101 |

[Killed] BlockStatement
src/shared/lib/ollama-endpoint.ts:39:6
 	const normalized = normalizeOllamaEndpoint(endpoint);
 	const normalizedApiPath = apiPath.startsWith("/") ? apiPath : `/${apiPath}`;
 
-	try {
-		const url = new URL(normalized);
-		// stripTrailingSlashes("/") === "" so the explicit pathname==="/"
-		// branch is redundant — both produce the same basePath.
-		const basePath = stripTrailingSlashes(url.pathname);
-		url.pathname = `${basePath}${normalizedApiPath}`;
-		return url.toString();
-	} catch {
+	try {} catch {
 		return `${stripTrailingSlashes(normalized)}${normalizedApiPath}`;
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

 99 | 	});
100 | });
101 |

[Killed] StringLiteral
src/shared/lib/ollama-endpoint.ts:44:18
 		// stripTrailingSlashes("/") === "" so the explicit pathname==="/"
 		// branch is redundant — both produce the same basePath.
 		const basePath = stripTrailingSlashes(url.pathname);
-		url.pathname = `${basePath}${normalizedApiPath}`;
+		url.pathname = ``;
 		return url.toString();
 	} catch {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

 99 | 	});
100 | });
101 |

[Killed] BlockStatement
src/shared/lib/ollama-endpoint.ts:46:10
 		const basePath = stripTrailingSlashes(url.pathname);
 		url.pathname = `${basePath}${normalizedApiPath}`;
 		return url.toString();
-	} catch {
-		return `${stripTrailingSlashes(normalized)}${normalizedApiPath}`;
-	}
+	} catch {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\ollama-endpoint.test.ts:

127 | 		// is unavailable, so the prepend-slash logic on L40 is the only thing
128 | 		// keeping the URL well-formed. With a no-leading-slash apiPath that hits
129 | 		// the catch path, removing L40's prepend would produce "not-a-urlapi/tags".
