[Killed] BlockStatement
src/shared/lib/openrouter-model-selection.ts:19:74
 	providerSlug?: string;
 }
 
-export function parseModelSelection(value: string): ParsedModelSelection {
-	// Empty input flows naturally through this code: lastIndexOf("@") === -1
-	// returns `{ modelId: "" }`, which is the same as the explicit guard
-	// would have produced.
-	const atIndex = value.lastIndexOf("@");
-	if (atIndex === -1) {
-		return { modelId: value };
-	}
-	const modelId = value.slice(0, atIndex);
-	const providerSlug = value.slice(atIndex + 1);
-	if (!providerSlug) {
-		return { modelId };
-	}
-	return { modelId, providerSlug };
-}
+export function parseModelSelection(value: string): ParsedModelSelection {}
 
 export function createModelSelection(modelId: string, providerSlug?: string): string {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

11 | 		// A mutator that flips `if (!value)` to `if (false)` would fall through
12 | 		// to the @-split path and produce `{ modelId: "" }` from lastIndexOf
13 | 		// returning -1 — same shape, so we additionally check that the

[Killed] ConditionalExpression
src/shared/lib/openrouter-model-selection.ts:24:6
 	// returns `{ modelId: "" }`, which is the same as the explicit guard
 	// would have produced.
 	const atIndex = value.lastIndexOf("@");
-	if (atIndex === -1) {
+	if (false) {
 		return { modelId: value };
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] UnaryOperator
src/shared/lib/openrouter-model-selection.ts:24:18
 	// returns `{ modelId: "" }`, which is the same as the explicit guard
 	// would have produced.
 	const atIndex = value.lastIndexOf("@");
-	if (atIndex === -1) {
+	if (atIndex === +1) {
 		return { modelId: value };
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

16 | 		expect(result).toEqual({ modelId: "" });
17 | 		expect("providerSlug" in result).toBe(false);
18 | 	});

[Killed] MethodExpression
src/shared/lib/openrouter-model-selection.ts:27:18
 	if (atIndex === -1) {
 		return { modelId: value };
 	}
-	const modelId = value.slice(0, atIndex);
+	const modelId = value;
 	const providerSlug = value.slice(atIndex + 1);
 	if (!providerSlug) {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

22 | 			modelId: "openai/gpt-4o",
23 | 		});
24 | 	});

[Killed] ArithmeticOperator
src/shared/lib/openrouter-model-selection.ts:28:35
 		return { modelId: value };
 	}
 	const modelId = value.slice(0, atIndex);
-	const providerSlug = value.slice(atIndex + 1);
+	const providerSlug = value.slice(atIndex - 1);
 	if (!providerSlug) {
 		return { modelId };
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

22 | 			modelId: "openai/gpt-4o",
23 | 		});
24 | 	});

[Killed] MethodExpression
src/shared/lib/openrouter-model-selection.ts:28:23
 		return { modelId: value };
 	}
 	const modelId = value.slice(0, atIndex);
-	const providerSlug = value.slice(atIndex + 1);
+	const providerSlug = value;
 	if (!providerSlug) {
 		return { modelId };
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

22 | 			modelId: "openai/gpt-4o",
23 | 		});
24 | 	});

[Killed] ConditionalExpression
src/shared/lib/openrouter-model-selection.ts:29:6
 	}
 	const modelId = value.slice(0, atIndex);
 	const providerSlug = value.slice(atIndex + 1);
-	if (!providerSlug) {
+	if (false) {
 		return { modelId };
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

30 | 		});
31 | 		expect(parseModelSelection("a@b@c")).toEqual({ modelId: "a@b", providerSlug: "c" });
32 | 	});

[Killed] BooleanLiteral
src/shared/lib/openrouter-model-selection.ts:29:6
 	}
 	const modelId = value.slice(0, atIndex);
 	const providerSlug = value.slice(atIndex + 1);
-	if (!providerSlug) {
+	if (providerSlug) {
 		return { modelId };
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

22 | 			modelId: "openai/gpt-4o",
23 | 		});
24 | 	});

[Killed] ObjectLiteral
src/shared/lib/openrouter-model-selection.ts:30:10
 	const modelId = value.slice(0, atIndex);
 	const providerSlug = value.slice(atIndex + 1);
 	if (!providerSlug) {
-		return { modelId };
+		return {};
 	}
 	return { modelId, providerSlug };
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

30 | 		});
31 | 		expect(parseModelSelection("a@b@c")).toEqual({ modelId: "a@b", providerSlug: "c" });
32 | 	});

[Killed] BlockStatement
src/shared/lib/openrouter-model-selection.ts:35:86
 	return { modelId, providerSlug };
 }
 
-export function createModelSelection(modelId: string, providerSlug?: string): string {
-	if (!modelId) {
-		return "";
-	}
-	if (!providerSlug) {
-		return modelId;
-	}
-	return `${modelId}@${providerSlug}`;
-}
+export function createModelSelection(modelId: string, providerSlug?: string): string {}
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] BlockStatement
src/shared/lib/openrouter-model-selection.ts:36:16
 }
 
 export function createModelSelection(modelId: string, providerSlug?: string): string {
-	if (!modelId) {
-		return "";
-	}
+	if (!modelId) {}
 	if (!providerSlug) {
 		return modelId;
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

47 | });
48 | 
49 | describe("createModelSelection", () => {

[Killed] ConditionalExpression
src/shared/lib/openrouter-model-selection.ts:36:6
 }
 
 export function createModelSelection(modelId: string, providerSlug?: string): string {
-	if (!modelId) {
+	if (true) {
 		return "";
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

51 | 		expect(createModelSelection("")).toBe("");
52 | 		expect(createModelSelection("", "deepinfra")).toBe("");
53 | 	});

[Killed] ConditionalExpression
src/shared/lib/openrouter-model-selection.ts:39:6
 	if (!modelId) {
 		return "";
 	}
-	if (!providerSlug) {
+	if (true) {
 		return modelId;
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

55 | 	test("returns modelId only when provider not supplied", () => {
56 | 		expect(createModelSelection("openai/gpt-4o")).toBe("openai/gpt-4o");
57 | 	});

[Killed] BlockStatement
src/shared/lib/openrouter-model-selection.ts:39:21
 	if (!modelId) {
 		return "";
 	}
-	if (!providerSlug) {
-		return modelId;
-	}
+	if (!providerSlug) {}
 	return `${modelId}@${providerSlug}`;
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\openrouter-model-selection.test.ts:

51 | 		expect(createModelSelection("")).toBe("");
52 | 		expect(createModelSelection("", "deepinfra")).toBe("");
53 | 	});
