[Killed] BlockStatement
widgets/openrouter-model-selector/lib/model-exclusion.ts:22:72
 export const OPENROUTER_AUTO_MODEL_ID = "openrouter/auto";
 
 /** Auto can be represented as either empty string `""` or `"openrouter/auto"`. */
-export function isAutoModel(value: string | undefined | null): boolean {
-	if (!value || value.trim() === "") return true;
-	return parseModelSelection(value).modelId === OPENROUTER_AUTO_MODEL_ID;
-}
+export function isAutoModel(value: string | undefined | null): boolean {}
 
 export interface ModelExclusionConfig {
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] ConditionalExpression
widgets/openrouter-model-selector/lib/model-exclusion.ts:23:6
 
 /** Auto can be represented as either empty string `""` or `"openrouter/auto"`. */
 export function isAutoModel(value: string | undefined | null): boolean {
-	if (!value || value.trim() === "") return true;
+	if (true) return true;
 	return parseModelSelection(value).modelId === OPENROUTER_AUTO_MODEL_ID;
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

31 | 		[OPENROUTER_AUTO_MODEL_ID, true],
32 | 		[`${OPENROUTER_AUTO_MODEL_ID}@deepinfra`, true],
33 | 		["openai/gpt-4o", false],

[Killed] BooleanLiteral
widgets/openrouter-model-selector/lib/model-exclusion.ts:23:44
 
 /** Auto can be represented as either empty string `""` or `"openrouter/auto"`. */
 export function isAutoModel(value: string | undefined | null): boolean {
-	if (!value || value.trim() === "") return true;
+	if (!value || value.trim() === "") return false;
 	return parseModelSelection(value).modelId === OPENROUTER_AUTO_MODEL_ID;
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

31 | 		[OPENROUTER_AUTO_MODEL_ID, true],
32 | 		[`${OPENROUTER_AUTO_MODEL_ID}@deepinfra`, true],
33 | 		["openai/gpt-4o", false],

[Killed] ConditionalExpression
widgets/openrouter-model-selector/lib/model-exclusion.ts:24:9
 /** Auto can be represented as either empty string `""` or `"openrouter/auto"`. */
 export function isAutoModel(value: string | undefined | null): boolean {
 	if (!value || value.trim() === "") return true;
-	return parseModelSelection(value).modelId === OPENROUTER_AUTO_MODEL_ID;
+	return true;
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

31 | 		[OPENROUTER_AUTO_MODEL_ID, true],
32 | 		[`${OPENROUTER_AUTO_MODEL_ID}@deepinfra`, true],
33 | 		["openai/gpt-4o", false],

[Killed] EqualityOperator
widgets/openrouter-model-selector/lib/model-exclusion.ts:24:9
 /** Auto can be represented as either empty string `""` or `"openrouter/auto"`. */
 export function isAutoModel(value: string | undefined | null): boolean {
 	if (!value || value.trim() === "") return true;
-	return parseModelSelection(value).modelId === OPENROUTER_AUTO_MODEL_ID;
+	return parseModelSelection(value).modelId !== OPENROUTER_AUTO_MODEL_ID;
 }
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

31 | 		[OPENROUTER_AUTO_MODEL_ID, true],
32 | 		[`${OPENROUTER_AUTO_MODEL_ID}@deepinfra`, true],
33 | 		["openai/gpt-4o", false],

[Killed] BooleanLiteral
widgets/openrouter-model-selector/lib/model-exclusion.ts:38:23
 
 const NO_EXCLUSION: ModelExclusionConfig = {
 	excludedModelId: undefined,
-	excludeAllProviders: false,
+	excludeAllProviders: true,
 	excludedProviderSlug: undefined,
 };
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] BlockStatement
widgets/openrouter-model-selector/lib/model-exclusion.ts:42:87
 	excludedProviderSlug: undefined,
 };
 
-function buildExclusionFromParsed(parsed: ParsedModelSelection): ModelExclusionConfig {
-	return parsed.modelId
-		? {
-				excludedModelId: parsed.modelId,
-				excludeAllProviders: !parsed.providerSlug,
-				excludedProviderSlug: parsed.providerSlug,
-			}
-		: NO_EXCLUSION;
-}
+function buildExclusionFromParsed(parsed: ParsedModelSelection): ModelExclusionConfig {}
 
 // Provider-side exclusion check shared by isFallbackExcluded and
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

55 | 			excludedProviderSlug: undefined,
56 | 		});
57 | 	});

[Killed] ObjectLiteral
widgets/openrouter-model-selector/lib/model-exclusion.ts:44:5
 
 function buildExclusionFromParsed(parsed: ParsedModelSelection): ModelExclusionConfig {
 	return parsed.modelId
-		? {
-				excludedModelId: parsed.modelId,
-				excludeAllProviders: !parsed.providerSlug,
-				excludedProviderSlug: parsed.providerSlug,
-			}
+		? {}
 		: NO_EXCLUSION;
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

55 | 			excludedProviderSlug: undefined,
56 | 		});
57 | 	});

[Killed] BooleanLiteral
widgets/openrouter-model-selector/lib/model-exclusion.ts:46:26
 	return parsed.modelId
 		? {
 				excludedModelId: parsed.modelId,
-				excludeAllProviders: !parsed.providerSlug,
+				excludeAllProviders: parsed.providerSlug,
 				excludedProviderSlug: parsed.providerSlug,
 			}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

55 | 			excludedProviderSlug: undefined,
56 | 		});
57 | 	});

[Killed] BlockStatement
widgets/openrouter-model-selector/lib/model-exclusion.ts:57:12
 function isProviderExcluded(
 	providerSlug: string | undefined,
 	config: ModelExclusionConfig
-): boolean {
-	return (
-		config.excludeAllProviders ||
-		!providerSlug ||
-		providerSlug === config.excludedProviderSlug
-	);
-}
+): boolean {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] ConditionalExpression
widgets/openrouter-model-selector/lib/model-exclusion.ts:59:3
 	config: ModelExclusionConfig
 ): boolean {
 	return (
-		config.excludeAllProviders ||
-		!providerSlug ||
-		providerSlug === config.excludedProviderSlug
+		true
 	);
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

120 | 		expect(isFallbackExcluded("openai/gpt-4o@anthropic", cfg)).toBe(true);
121 | 	});
122 |

[Killed] LogicalOperator
widgets/openrouter-model-selector/lib/model-exclusion.ts:59:3
 	config: ModelExclusionConfig
 ): boolean {
 	return (
-		config.excludeAllProviders ||
-		!providerSlug ||
-		providerSlug === config.excludedProviderSlug
+		(config.excludeAllProviders || !providerSlug) && providerSlug === config.excludedProviderSlug
 	);
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

115 | 	});
116 | 
117 | 	test("same model with primary 'all providers' excluded → fallback always excluded", () => {

[Killed] BooleanLiteral
widgets/openrouter-model-selector/lib/model-exclusion.ts:60:3
 ): boolean {
 	return (
 		config.excludeAllProviders ||
-		!providerSlug ||
+		providerSlug ||
 		providerSlug === config.excludedProviderSlug
 	);
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

120 | 		expect(isFallbackExcluded("openai/gpt-4o@anthropic", cfg)).toBe(true);
121 | 	});
122 |

[Killed] EqualityOperator
widgets/openrouter-model-selector/lib/model-exclusion.ts:61:3
 	return (
 		config.excludeAllProviders ||
 		!providerSlug ||
-		providerSlug === config.excludedProviderSlug
+		providerSlug !== config.excludedProviderSlug
 	);
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] ConditionalExpression
widgets/openrouter-model-selector/lib/model-exclusion.ts:61:3
 	return (
 		config.excludeAllProviders ||
 		!providerSlug ||
-		providerSlug === config.excludedProviderSlug
+		false
 	);
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

121 | 	});
122 | 
123 | 	test("same model + different provider not excluded when primary pinned a single provider", () => {

[Killed] BlockStatement
widgets/openrouter-model-selector/lib/model-exclusion.ts:71:25
  */
 export function computeModelExclusionConfig(
 	primaryValue: string | undefined | null
-): ModelExclusionConfig {
-	// Combine the null/undefined check with isAutoModel so TS narrows
-	// `primaryValue` to a definite string after the guard. This removes the
-	// previously-required `?? ""` fallback (which was unreachable in
-	// practice — isAutoModel already short-circuits for null/undefined).
-	if (!primaryValue || isAutoModel(primaryValue)) return NO_EXCLUSION;
-	return buildExclusionFromParsed(parseModelSelection(primaryValue));
-}
+): ModelExclusionConfig {}
 
 /** True when the fallback selection conflicts with the primary. */
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

37 | 	});
38 | });
39 |

[Killed] ConditionalExpression
widgets/openrouter-model-selector/lib/model-exclusion.ts:76:6
 	// `primaryValue` to a definite string after the guard. This removes the
 	// previously-required `?? ""` fallback (which was unreachable in
 	// practice — isAutoModel already short-circuits for null/undefined).
-	if (!primaryValue || isAutoModel(primaryValue)) return NO_EXCLUSION;
+	if (false) return NO_EXCLUSION;
 	return buildExclusionFromParsed(parseModelSelection(primaryValue));
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] BooleanLiteral
widgets/openrouter-model-selector/lib/model-exclusion.ts:76:6
 	// `primaryValue` to a definite string after the guard. This removes the
 	// previously-required `?? ""` fallback (which was unreachable in
 	// practice — isAutoModel already short-circuits for null/undefined).
-	if (!primaryValue || isAutoModel(primaryValue)) return NO_EXCLUSION;
+	if (primaryValue || isAutoModel(primaryValue)) return NO_EXCLUSION;
 	return buildExclusionFromParsed(parseModelSelection(primaryValue));
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] BlockStatement
widgets/openrouter-model-selector/lib/model-exclusion.ts:84:12
 export function isFallbackExcluded(
 	fallbackValue: string | undefined | null,
 	exclusionConfig: ModelExclusionConfig
-): boolean {
-	// Empty/null/undefined fallback → not excluded. Handling this explicitly
-	// (instead of routing through `parseModelSelection(fallbackValue ?? "")`)
-	// removes the dead `??` fallback branch and lets TS narrow `fallbackValue`
-	// to `string` for the remaining logic.
-	if (!fallbackValue) return false;
-	const { modelId, providerSlug } = parseModelSelection(fallbackValue);
-	return (
-		modelId === exclusionConfig.excludedModelId &&
-		isProviderExcluded(providerSlug, exclusionConfig)
-	);
-}
+): boolean {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

86 | 		const cfg = computeModelExclusionConfig("");
87 | 		// All inputs must come back false because the guard short-circuits.
88 | 		// Mutating `if (!excludedModelId) return false` to skip the early-return

[Killed] ConditionalExpression
widgets/openrouter-model-selector/lib/model-exclusion.ts:89:6
 	// (instead of routing through `parseModelSelection(fallbackValue ?? "")`)
 	// removes the dead `??` fallback branch and lets TS narrow `fallbackValue`
 	// to `string` for the remaining logic.
-	if (!fallbackValue) return false;
+	if (true) return false;
 	const { modelId, providerSlug } = parseModelSelection(fallbackValue);
 	return (
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

114 | 		expect(isFallbackExcluded("anthropic/claude-3", cfg)).toBe(false);
115 | 	});
116 |

[Killed] BooleanLiteral
widgets/openrouter-model-selector/lib/model-exclusion.ts:89:29
 	// (instead of routing through `parseModelSelection(fallbackValue ?? "")`)
 	// removes the dead `??` fallback branch and lets TS narrow `fallbackValue`
 	// to `string` for the remaining logic.
-	if (!fallbackValue) return false;
+	if (!fallbackValue) return true;
 	const { modelId, providerSlug } = parseModelSelection(fallbackValue);
 	return (
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

93 | 		expect(isFallbackExcluded("anthropic/claude-3", cfg)).toBe(false);
94 | 	});
95 |

[Killed] EqualityOperator
widgets/openrouter-model-selector/lib/model-exclusion.ts:92:3
 	if (!fallbackValue) return false;
 	const { modelId, providerSlug } = parseModelSelection(fallbackValue);
 	return (
-		modelId === exclusionConfig.excludedModelId &&
+		modelId !== exclusionConfig.excludedModelId &&
 		isProviderExcluded(providerSlug, exclusionConfig)
 	);
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

86 | 		const cfg = computeModelExclusionConfig("");
87 | 		// All inputs must come back false because the guard short-circuits.
88 | 		// Mutating `if (!excludedModelId) return false` to skip the early-return

[Killed] ConditionalExpression
widgets/openrouter-model-selector/lib/model-exclusion.ts:92:3
 	if (!fallbackValue) return false;
 	const { modelId, providerSlug } = parseModelSelection(fallbackValue);
 	return (
-		modelId === exclusionConfig.excludedModelId &&
-		isProviderExcluded(providerSlug, exclusionConfig)
+		true
 	);
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

86 | 		const cfg = computeModelExclusionConfig("");
87 | 		// All inputs must come back false because the guard short-circuits.
88 | 		// Mutating `if (!excludedModelId) return false` to skip the early-return

[Killed] BlockStatement
widgets/openrouter-model-selector/lib/model-exclusion.ts:104:22
 export function filterModelsForFallback(
 	models: OpenRouterModel[],
 	exclusionConfig: ModelExclusionConfig
-): OpenRouterModel[] {
-	// The `if (!excludedModelId)` early-return is redundant — the only
-	// excludeAllProviders=true paths come from computeModelExclusionConfig,
-	// which couples it to a defined excludedModelId. When excludeAllProviders
-	// is false, we return `models` unchanged (preserving reference identity).
-	if (exclusionConfig.excludeAllProviders) {
-		return models.filter((m) => m.id !== exclusionConfig.excludedModelId);
-	}
-	return models;
-}
+): OpenRouterModel[] {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

141 | 	});
142 | });
143 |

[Killed] BlockStatement
widgets/openrouter-model-selector/lib/model-exclusion.ts:109:43
 	// excludeAllProviders=true paths come from computeModelExclusionConfig,
 	// which couples it to a defined excludedModelId. When excludeAllProviders
 	// is false, we return `models` unchanged (preserving reference identity).
-	if (exclusionConfig.excludeAllProviders) {
-		return models.filter((m) => m.id !== exclusionConfig.excludedModelId);
-	}
+	if (exclusionConfig.excludeAllProviders) {}
 	return models;
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

157 | 
158 | 	test("removes ONLY the excluded model and KEEPS all others (kills 'filter → false' / 'filter → undefined' mutants)", () => {
159 | 		const cfg = computeModelExclusionConfig("openai/gpt-4o");

[Killed] ConditionalExpression
widgets/openrouter-model-selector/lib/model-exclusion.ts:109:6
 	// excludeAllProviders=true paths come from computeModelExclusionConfig,
 	// which couples it to a defined excludedModelId. When excludeAllProviders
 	// is false, we return `models` unchanged (preserving reference identity).
-	if (exclusionConfig.excludeAllProviders) {
+	if (false) {
 		return models.filter((m) => m.id !== exclusionConfig.excludedModelId);
 	}
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

157 | 
158 | 	test("removes ONLY the excluded model and KEEPS all others (kills 'filter → false' / 'filter → undefined' mutants)", () => {
159 | 		const cfg = computeModelExclusionConfig("openai/gpt-4o");

[Killed] EqualityOperator
widgets/openrouter-model-selector/lib/model-exclusion.ts:110:31
 	// which couples it to a defined excludedModelId. When excludeAllProviders
 	// is false, we return `models` unchanged (preserving reference identity).
 	if (exclusionConfig.excludeAllProviders) {
-		return models.filter((m) => m.id !== exclusionConfig.excludedModelId);
+		return models.filter((m) => m.id === exclusionConfig.excludedModelId);
 	}
 	return models;
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);

[Killed] ConditionalExpression
widgets/openrouter-model-selector/lib/model-exclusion.ts:110:31
 	// which couples it to a defined excludedModelId. When excludeAllProviders
 	// is false, we return `models` unchanged (preserving reference identity).
 	if (exclusionConfig.excludeAllProviders) {
-		return models.filter((m) => m.id !== exclusionConfig.excludedModelId);
+		return models.filter((m) => true);
 	}
 	return models;
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

157 | 
158 | 	test("removes ONLY the excluded model and KEEPS all others (kills 'filter → false' / 'filter → undefined' mutants)", () => {
159 | 		const cfg = computeModelExclusionConfig("openai/gpt-4o");

[Killed] BlockStatement
widgets/openrouter-model-selector/lib/model-exclusion.ts:123:12
 	modelId: string,
 	providerSlug: string | undefined,
 	exclusionConfig: ModelExclusionConfig
-): boolean {
-	// Same simplification as isFallbackExcluded — the `!excludedModelId`
-	// early-return is redundant because `string !== undefined` is the
-	// same answer as the early-return path produces.
-	return (
-		modelId === exclusionConfig.excludedModelId &&
-		isProviderExcluded(providerSlug, exclusionConfig)
-	);
-}
+): boolean {}
 
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\widgets\openrouter-model-selector\lib\model-exclusion.test.ts:

174 | });
175 | 
176 | describe("isEndpointExcluded", () => {

[Killed] LogicalOperator
widgets/openrouter-model-selector/lib/model-exclusion.ts:128:3
 	// early-return is redundant because `string !== undefined` is the
 	// same answer as the early-return path produces.
 	return (
-		modelId === exclusionConfig.excludedModelId &&
-		isProviderExcluded(providerSlug, exclusionConfig)
+		modelId === exclusionConfig.excludedModelId || isProviderExcluded(providerSlug, exclusionConfig)
 	);
 }
killedBy: All tests
statusReason: bun test v1.3.6 (d530ed99)


src\shared\lib\errors.test.ts:

407 | 		expect(timestamps).toHaveLength(3);
408 | 		const gap1 = (timestamps[1] ?? 0) - (timestamps[0] ?? 0);
409 | 		const gap2 = (timestamps[2] ?? 0) - (timestamps[1] ?? 0);
